app/controllers/activities_controller.rb

  def index
    @limit = 10.to_f
    if params[:page]
      @page = params[:page]
      @page = @page.to_f
      @page = @page -1
    else
      @page = 0
    end
    pagemultiplier = @limit * @page
    @conditions = {}
    @conditions[:hierarchy] = '1' unless !(params[:implementing_org].blank? and params[:recipient_country].blank? and params[:iati_identifier].blank? and params[:recipient_region].blank? and params[:policy_marker].blank?)
    @conditions[:implementing_org] = params[:implementing_org] unless params[:implementing_org].blank?
    @conditions[:recipient_country] = [params[:recipient_country].titleize, params[:recipient_country].upcase] unless params[:recipient_country].blank?
    @conditions[:recipient_region] = params[:recipient_region] unless params[:recipient_region].blank?
    @conditions[:iati_identifier] = params[:iati_identifier] unless params[:iati_identifier].blank?
    if @conditions[:recipient_country]
	@conditions.delete(:hierarchy)
    end
    if params[:sector]
      sector_conditions = {}
      sector_conditions[:sector_id] = params[:sector]
      @sector=SectorsActivity.find(:all, :conditions=>sector_conditions)
      @conditions[:id] = @sector
    end
      @numcountries = Activity.count(:recipient_country, :distinct=>true)
---
SELECT * FROM "sectors_activities" WHERE ("sectors_activities"."sector_id" = '2')
SELECT * FROM "activities"
SELECT count(*) AS count_all FROM "activities"

  def show
    @activity = Activity.find(params[:id])
---
SELECT * FROM "activities" WHERE ("activities"."id" = 17)

  def edit
    @activity = Activity.find(params[:id])
---
SELECT * FROM "activities" WHERE ("activities"."id" = 1)

  def create
    @activity = Activity.new(params[:activity])

    respond_to do |format|
      if @activity.save
---
INSERT INTO "activities" ("package_id", "default_finance_type", "default_tied_status", "hierarchy", "funding_org_type", "legacy_data_name", "created_at", "implementing_org_ref", "collaboration_type", "title", "date_start_planned", "extending_org_ref", "updated_at", "funding_org_ref", "collaboration_type_code", "default_flow_type", "default_finance_type_code", "date_end_planned", "extending_org_type", "default_aid_type", "date_end_actual", "contact_organisation", "reporting_org_type", "extending_org", "implementing_org", "recipient_region", "default_aid_type_code", "date_start_actual", "status_code", "default_tied_status_code", "last_updated", "contact_telephone", "legacy_data_value", "default_currency", "reporting_org", "funding_org", "description", "reporting_org_ref", "recipient_region_code", "recipient_country", "default_flow_type_code", "iati_identifier", "status", "contact_email", "legacy_data_iati_equivalent", "activity_lang", "implementing_org_type", "recipient_country_code", "contact_mailing_address") VALUES('xyz', '', '', '', '', '', '2011-06-12 22:28:37', '', '', '', '2011-06-12', '', '2011-06-12 22:28:37', '', '', '', '', '2011-06-12', '', '', '2011-06-12', '', '', '', '', '', '', '2011-06-12', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '')

  def destroy
    @activity = Activity.find(params[:id])
    @activity.destroy
---
SELECT * FROM "activities" WHERE ("activities"."id" = 16)
DELETE FROM "activities" WHERE "id" = 16