app/controllers/iatiregistry_controller.rb

SELECT * FROM "packages" WHERE ("packages"."id" = 9)
UPDATE "packages" SET "updated_at" = '2011-06-12 16:22:47', "retrieved_date" = '2011-06-12 17:22:47', "retrieved" = 1 WHERE "id" = 11
SELECT * FROM "activities" WHERE ("activities"."package_id" = '9aca73a8-c229-4fa1-8f39-ced49fa2415f') LIMIT 1
---
  def getPackage
    @package = Package.find(params[:id])
	  pu = {}
	  pu[:retrieved] = 1
	  pu[:retrieved_date] = DateTime.now
	  @package.update_attributes(pu)

    # check if this package is already in db
    @thetext ='';
    @activity_exists = Activity.find_by_package_id(@package.packageid)

INSERT INTO "sectors" ("created_at", "vocab", "code", "updated_at", "text") VALUES('2011-06-12 03:41:12', NULL, '14010', '2011-06-12 03:41:12', 'Water resources policy and administrative management')
---

			sectors = []
			activity.elements.each('sector') do |s|
				sectors << {

INSERT INTO "policy_markers" ("created_at", "vocab", "code", "updated_at", "text") VALUES('2011-06-12 03:58:37', 'DAC', '1', '2011-06-12 03:58:37', 'Gender Equality')
---

			policy_markers = []
			activity.elements.each('policy-marker') do |pm|
				policy_markers << {

INSERT INTO "activities" ("default_finance_type", "default_tied_status", "hierarchy", "funding_org_type", "created_at", "collaboration_type", "title", "date_start_planned", "extending_org_ref", "updated_at", "funding_org_ref", "collaboration_type_code", "default_flow_type", "default_finance_type_code", "date_end_planned", "extending_org_type", "default_aid_type", "date_end_actual", "contact_organisation", "reporting_org_type", "extending_org", "recipient_region", "default_aid_type_code", "date_start_actual", "status_code", "default_tied_status_code", "last_updated", "contact_telephone", "default_currency", "reporting_org", "funding_org", "description", "reporting_org_ref", "recipient_region_code", "default_flow_type_code", "iati_identifier", "status", "contact_email", "activity_lang", "contact_mailing_address") VALUES(NULL, NULL, '', NULL, '2011-06-12 03:00:04', NULL, NULL, NULL, NULL, '2011-06-12 03:00:04', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2011-05-13 14:28:20.8721550', NULL, 'USD', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 'en', NULL)
INSERT INTO "related_activities" ("created_at", "updated_at", "activity_id", "text", "ref", "reltype") VALUES('2011-06-12 04:14:17', '2011-06-12 04:14:17', 83, 'PROCOFSERVICES and P0007 for Nile Basin Initiative', 'GB-1-102580-101', '2')
---
			a[:default_tied_status_code] = activity.elements["default-tied-status"].attributes["code"] if activity.elements["default-tied-status"].attributes["code"]
			related_activity = []
			activity.elements.each('related-activity') do |rel|
				related_activity << {

INSERT INTO "transactions" ("value_currency", "receiver_org", "aid_type", "finance_type", "disbursement_channel_code", "provider_org_ref", "transaction_date_iso", "created_at", "provider_org", "flow_type", "flow_type_code", "updated_at", "activity_id", "finance_type_code", "transaction_type", "value", "transaction_type_code", "transaction_date", "aid_type_code", "provider_org_type", "value_date", "description", "tied_status_code", "receiver_org_type", "receiver_org_ref") VALUES(NULL, NULL, NULL, NULL, NULL, NULL, '2003-04-01Z', '2011-06-12 03:22:25', NULL, NULL, NULL, '2011-06-12 03:22:25', 8, NULL, 'Commitment', '20000', 'C', 'Budget for financial year 2003', NULL, NULL, '2003-04-01Z', NULL, NULL, NULL, NULL)
---
			transactions = []
			activity.elements.each('transaction') do |t|
				t.elements["transaction-date"].attributes["iso-date"].chop! if t.elements["transaction-date"].attributes["iso-date"] and @package.donors=='dfid'
				transactions << {

SELECT * FROM "sectors" WHERE ("sectors"."text" = 'Water resources policy and administrative management') LIMIT 1
---
				  end
			end
			sectors.each do |sr|
				thesr = Sector.find_by_text(sr[:text])

INSERT INTO "sectors_activities" ("sector_id", "created_at", "updated_at", "activity_id", "percentage") VALUES(1, '2011-06-12 14:50:14', '2011-06-12 14:50:14', 2, NULL)
---

				@sector_activities = SectorsActivity.new(sector_activities)

				  if @sector_activities.save

SELECT * FROM "policy_markers" WHERE ("policy_markers"."text" = 'Gender Equality') LIMIT 1
---
				  end
			end
			policy_markers.each do |pom|
				thepom = PolicyMarker.find_by_text(pom[:text])

INSERT INTO "policy_markers_activities" ("created_at", "updated_at", "activity_id", "significance", "policy_marker_id") VALUES('2011-06-12 14:50:14', '2011-06-12 14:50:14', 2, NULL, 1)
---
				policy_markers_activities[:activity_id] = @activity.id.to_s
				@pma = PolicyMarkersActivity.new(policy_markers_activities)

				  if @pma.save

SELECT * FROM "packages" WHERE ("packages"."packageid" = '9aca73a8-c229-4fa1-8f39-ced49fa2415f') LIMIT 1
---
  def index
    # Let's look at the IATI Registry
    url = "http://iatiregistry.org/api/2/rest/package"
    puts url
    result = Net::HTTP.get(URI(url))
    packages = ActiveSupport::JSON.decode(result)
    @showpackages = ''
    @max = 5
    @count = 0
    #packages = packages.first(1)
    # check if package already has been downloaded
    packages.each do |x|
	thepackage = Package.find_by_packageid(x)

INSERT INTO "packages" ("name", "groups", "ratings_average", "resources_packageid", "maintainer_email", "donors_type", "resources_hash", "created_at", "title", "author", "revisionid", "iati_preview", "activity_count", "country", "activity_period_to", "notes", "license", "groups_types", "resources_url", "updated_at", "url", "maintainer", "donors", "activity_period_from", "resourcesid", "resources_description", "packageid", "tags", "retrieved_date", "version", "donors_country", "resources_position", "ckan_url", "author_email", "verified", "ratings_count", "resources_format", "licenseid", "state", "retrieved") VALUES('hewlett-foundation-org', '709c1cc5-e0b4-46dc-97d8-2ed42d7b80e8', NULL, '26496736-392d-489d-a5e1-10a0061cc77b', NULL, 'Foundation', '', '2011-06-12 15:26:45', 'Hewlett Foundation Organisation File', NULL, '127792f0-d2e6-4f74-bff4-95da5e48313d', NULL, '', '', NULL, NULL, NULL, 'Donor', 'http://www.hewlett.org/uploads/documents/IATIOrg.xml', '2011-06-12 15:26:45', NULL, NULL, 'The William and Flora Hewlett Foundation', NULL, '9767db65-6a4a-4d44-a4bf-931639a2f6eb', 'Organisation File', '26496736-392d-489d-a5e1-10a0061cc77b', NULL, NULL, NULL, 'United States', 0, 'http://iatiregistry.org/package/hewlett-foundation-org', 'communications@hewlett.org', 'yes', 0, 'XML', NULL, 'active', NULL)
---

		  @package = Package.new(newpackage)

		  if @package.save