app/controllers/packages_controller.rb

  def index
    @packages = Package.all
---
SELECT * FROM "packages"

  def show
    @package = Package.find(params[:id])
---
SELECT * FROM "packages" WHERE ("packages"."id" = 1)

  def edit
    @package = Package.find(params[:id])
---
SELECT * FROM "packages" WHERE ("packages"."id" = 11)

  def create
    @package = Package.new(params[:package])

    respond_to do |format|
      if @package.save
---
INSERT INTO "packages" ("name", "groups", "ratings_average", "resources_packageid", "maintainer_email", "donors_type", "resources_hash", "created_at", "title", "author", "revisionid", "iati_preview", "activity_count", "country", "activity_period_to", "notes", "license", "groups_types", "resources_url", "updated_at", "url", "maintainer", "donors", "activity_period_from", "resourcesid", "resources_description", "packageid", "tags", "version", "donors_country", "resources_position", "ckan_url", "author_email", "verified", "ratings_count", "resources_format", "licenseid", "state") VALUES('lkjdsakljasd', 'lkmklml', 'lmlkmkl', 'lmlkmlmlkm', 'lk', 'lm', 'lkmlkmklm', '2011-06-10 23:20:52', 'lakdj34qwe', 'jlj', 'mklmkl', 'lmlmlkm', 'lmlkmlkmlkm', 'lmlmlkm', '2011-06-10', 'jlk', 'mlkm', 'kmlm', 'lmlmlkm', '2011-06-10 23:20:52', 'asldkjasldjaskl', 'lj', 'klm', '2011-06-10', 'lmlmlm', 'klmlkmlkm', 'wqeq4qewc', 'klmlkm', 'asdejwdlasjdklj', 'lmlmlkm', 'lmlkmlm', 'lmlkmlkml', 'kljlkdsfljdslfj', 'lmlkmlkm', 'lmlmlkm', 'lkmlmlkm', 'llkklm', 'kl')

  def update
    @package = Package.find(params[:id])

    respond_to do |format|
      if @package.update_attributes(params[:package])
---
SELECT * FROM "packages" WHERE ("packages"."id" = 10)
UPDATE "packages" SET "updated_at" = '2011-06-11 02:04:36', "maintainer" = '', "iati_preview" = '<table width="100%"><thead><tr><th class="activity-title">

  def destroy
    @package = Package.find(params[:id])
    @package.destroy
---
SELECT * FROM "packages" WHERE ("packages"."id" = 1)
DELETE FROM "packages" WHERE "id" = 1