app/controllers/policy_markers_activities_controller.rb

  def index
    @policy_markers_activities = PolicyMarkersActivity.all
---
SELECT * FROM "policy_markers_activities"