app/controllers/policy_markers_controller.rb

  def index
    @policy_markers = PolicyMarker.all
---
SELECT * FROM "policy_markers"