app/controllers/related_activities_controller.rb

  def index
    @related_activities = RelatedActivity.all
---
SELECT * FROM "related_activities"