app/controllers/sectors_activities_controller.rb

SELECT * FROM "sectors_activities"
---
  def index
    @sectors_activities = SectorsActivity.all